Mrunmoy/HelixDrift/zephyr_apps/nrf52840-mocap-bridge/src/main.cpp
	host_write(line);
}

#if defined(CONFIG_USB_DEVICE_STACK) || defined(CONFIG_USB_DEVICE_STACK_NEXT)
static int host_stream_init(void)
{
	if (!device_is_ready(host_stream)) {
		return -ENODEV;
	}

	return helix_usbd_enable(host_stream, CONFIG_HELIX_MOCAP_USB_WAIT_FOR_DTR_MS);
}
#else
static int host_stream_init(void)
{
	return device_is_ready(host_stream) ? 0 : -ENODEV;
}
#endif

#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_CENTRAL)
static struct NodeTrack *find_or_add_track(uint8_t node_id)
{
	struct NodeTrack *free_slot = NULL;

	for (size_t i = 0; i < ARRAY_SIZE(tracked_nodes); ++i) {
		if (tracked_nodes[i].active && tracked_nodes[i].node_id == node_id) {
			return &tracked_nodes[i];
		}
		if (!tracked_nodes[i].active && free_slot == NULL) {
			free_slot = &tracked_nodes[i];
		}
	}

	if (free_slot == NULL) {
		return NULL;
	}

	free_slot->active = true;
	free_slot->node_id = node_id;
	g_helixMocapStatus.tracked_nodes++;
	return free_slot;
}

static void host_emit_frame(const struct HelixMocapFrame *frame, uint32_t rx_timestamp_us,
			    uint32_t gaps)
{
	char line[224];

	snprintk(line,
		 sizeof(line),
		 "FRAME node=%u seq=%u node_us=%u sync_us=%u rx_us=%u yaw_cd=%d pitch_cd=%d roll_cd=%d x_mm=%d y_mm=%d z_mm=%d gaps=%u\n",
		 frame->node_id,
		 frame->sequence,
		 frame->node_local_timestamp_us,
		 frame->node_synced_timestamp_us,
		 rx_timestamp_us,
		 frame->yaw_cdeg,
		 frame->pitch_cdeg,
		 frame->roll_cdeg,
		 frame->x_mm,
		 frame->y_mm,
		 frame->z_mm,
		 gaps);
	host_write(line);
	g_helixMocapStatus.usb_lines++;
}

static void central_handle_frame(const struct esb_payload *payload)
{
	const struct HelixMocapFrame *frame = (const struct HelixMocapFrame *)payload->data;
	struct NodeTrack *track;
	uint32_t rx_timestamp_us = now_us();
	uint32_t gaps = 0U;

	if (payload->length < sizeof(*frame) ||
	    frame->type != HELIX_PACKET_MOCAP_FRAME ||
	    frame->session_tag != (uint8_t)CONFIG_HELIX_MOCAP_SESSION_TAG) {
		return;
	}

	track = find_or_add_track(frame->node_id);
	if (track == NULL) {
		return;
	}

	if (track->packets > 0U) {
		const uint8_t expected = (uint8_t)(track->last_sequence + 1U);
		if (frame->sequence != expected) {
			gaps = (uint8_t)(frame->sequence - expected);
			track->gaps += gaps;
		}
	}

	track->packets++;
	track->last_sequence = frame->sequence;
	track->last_node_timestamp_us = frame->node_local_timestamp_us;
	track->last_synced_timestamp_us = frame->node_synced_timestamp_us;
	track->last_rx_timestamp_us = rx_timestamp_us;

	g_helixMocapStatus.last_node_id = frame->node_id;
	g_helixMocapStatus.last_sequence = frame->sequence;

	host_emit_frame(frame, rx_timestamp_us, gaps);

	struct esb_payload ack = {
		.pipe = payload->pipe,
	};

	/* Build anchor. If this Tag is the current OTA-trigger target (or
	 * broadcast 0xFF), set the OTA request flag.  Unlike the old
	 * 'replace ACK payload' approach that fought the radio's ACK
	 * latching, this piggybacks the request on the reliable anchor
	 * flow.  retries counts how many FRAMEs we'll keep setting the
	 * flag for — the Tag reboots on the first one it sees. */
	bool set_ota_flag = (ota_trigger_target_node != 0u &&
	    (ota_trigger_target_node == 0xFFu ||
	     ota_trigger_target_node == frame->node_id));

	struct HelixSyncAnchor anchor = {
		.type = HELIX_PACKET_SYNC_ANCHOR,
		.central_id = (uint8_t)CONFIG_HELIX_MOCAP_CENTRAL_ID,
		.anchor_sequence = next_anchor_sequence++,
		.session_tag = (uint8_t)CONFIG_HELIX_MOCAP_SESSION_TAG,
		.central_timestamp_us = rx_timestamp_us,
		.flags = static_cast<uint8_t>(set_ota_flag ? HELIX_ANCHOR_FLAG_OTA_REQ : 0),
	};
	ack.length = sizeof(anchor);
	memcpy(ack.data, &anchor, sizeof(anchor));
	if (esb_write_payload(&ack) == 0) {
		g_helixMocapStatus.anchors_sent++;
		if (set_ota_flag) {
			ota_triggers_sent++;
			if (ota_trigger_retries > 0u) {
				ota_trigger_retries--;
			} else {
				ota_trigger_target_node = 0u; /* done */
			}
		}
	}
}
#endif

#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE)
static int16_t synth_wave(uint8_t sequence, int32_t mul, int32_t span)
{
	int32_t phase = ((int32_t)sequence * mul) % (span * 2);

	if (phase > span) {
		phase = (span * 2) - phase;
	}

	return (int16_t)(phase - (span / 2));
}

static void node_fill_frame(struct HelixMocapFrame *frame)
{
	const uint8_t sequence = (uint8_t)(g_helixMocapStatus.tx_attempts & 0xFF);
	const uint32_t local_us = now_us();
	const uint32_t synced_us = local_us - (uint32_t)estimated_offset_us;

	frame->type = HELIX_PACKET_MOCAP_FRAME;
	frame->node_id = (uint8_t)CONFIG_HELIX_MOCAP_NODE_ID;
	frame->sequence = sequence;
	frame->session_tag = (uint8_t)CONFIG_HELIX_MOCAP_SESSION_TAG;
	frame->node_local_timestamp_us = local_us;
	frame->node_synced_timestamp_us = synced_us;
	frame->yaw_cdeg = synth_wave(sequence, 37, 3600);
	frame->pitch_cdeg = synth_wave(sequence, 23, 1800);
	frame->roll_cdeg = synth_wave(sequence, 17, 1800);
	frame->x_mm = synth_wave(sequence, 11, 1200);
	frame->y_mm = synth_wave(sequence, 13, 1200);
	frame->z_mm = synth_wave(sequence, 19, 1200);
}

static void node_handle_anchor(const struct esb_payload *payload)
{
	if (payload->length < 1) {
		return;
	}

	/* Check for OTA trigger packet. This runs in ESB ISR context —
	 * just set the flag; the main loop does the actual reboot. */
	if (payload->data[0] == HELIX_PACKET_OTA_TRIGGER &&
	    payload->length >= sizeof(HelixOtaTrigger)) {
		const struct HelixOtaTrigger *trig =
			(const struct HelixOtaTrigger *)payload->data;
		if (trig->session_tag == (uint8_t)CONFIG_HELIX_MOCAP_SESSION_TAG &&
		    trig->magic == kOtaTriggerMagic &&
		    (trig->target_node_id == 0xFFu ||
		     trig->target_node_id == (uint8_t)CONFIG_HELIX_MOCAP_NODE_ID)) {
			atomic_set(&ota_reboot_pending, 1);
		}
		return;
	}

	const struct HelixSyncAnchor *anchor = (const struct HelixSyncAnchor *)payload->data;
	const uint32_t local_us = now_us();

	/* Accept both 8-byte (legacy, no flags) and 9-byte (flags) anchors.
	 * sizeof(HelixSyncAnchor) is 9 in v2+, we check the legacy 8. */
	constexpr size_t kLegacyAnchorSize = 8u;
	if (payload->length < kLegacyAnchorSize ||
	    anchor->type != HELIX_PACKET_SYNC_ANCHOR ||
	    anchor->session_tag != (uint8_t)CONFIG_HELIX_MOCAP_SESSION_TAG) {
		return;
	}

	/* If anchor carries flags (>=9 bytes) and OTA request bit is set,
	 * reboot into BLE OTA window. ISR-safe: atomic flag, main loop
	 * handles the actual reboot. */
	if (payload->length >= sizeof(*anchor) &&
	    (anchor->flags & HELIX_ANCHOR_FLAG_OTA_REQ)) {
		atomic_set(&ota_reboot_pending, 1);
	}

